In [62]:
# pymongo에 있는 MongoClient라는 클래스 호출
from pymongo import MongoClient
import pandas as pd

In [63]:
# class 형태 __init__ 인자 받음
client = MongoClient(
    host = 'localhost',
    port = 27017
)

In [64]:
# 어떤 데이터베이스들이 존재하는지 보여줌
client.list_database_names()

['admin', 'config', 'local', 'ubion']

In [65]:
# 몽고는 커서 지정 필요없음
# 커서 타입이라 list로 출력해줘야함
db = client["ubion"]
# dictionary value값 구하는 형태
list(db.test.find())
# = list(db["test"].find())
# SELECT * FROM test

TypeError: 'dict' object is not callable

In [ ]:
data = {
    "1" : "1",
    "2" : "2",
    "3" : "3"
}


db.test.insert_one(data)

# INSERT INTO test VALUE(data)

In [ ]:
### data 변수 만들어서 insert_many 를 사용해볼 것
data = [{
    "1":"2"
},
{"3":"4"}
]

db.test.insert_many(data)

In [ ]:
list(db.test.find())
#_id는 primary key 역할

[{'_id': ObjectId('62328e9f62878024c7c417f2'),
  'name': 'test',
  'phone': '12345678'},
 {'_id': ObjectId('6232911a62878024c7c417f4'), 'loc': 'Seoul'},
 {'_id': ObjectId('6232911a62878024c7c417f5'),
  'gender': 'male',
  'age': 20.0,
  'hobby': 'soccer'},
 {'_id': ObjectId('623291ba62878024c7c417f6'), 'name': 'test2', 'age': 40.0},
 {'_id': ObjectId('623297eeeb7b4c7c25214424'), '1': '1', '2': '2', '3': '3'},
 {'_id': ObjectId('62329a0deb7b4c7c25214425'), '1': '2'},
 {'_id': ObjectId('62329a0deb7b4c7c25214426'), '3': '4'}]

In [ ]:
import mod_sql

In [ ]:
_db = mod_sql.Database()

In [ ]:
sql = """
        SELECT * FROM emp
"""
result = _db.executeAll(sql)
result

[{'EMPNO': Decimal('7369'),
  'ENAME': 'SMITH',
  'JOB': 'CLERK',
  'MGR': Decimal('7902'),
  'HIREDATE': datetime.date(1980, 12, 17),
  'SAL': Decimal('800.00'),
  'COMM': None,
  'DEPTNO': Decimal('20')},
 {'EMPNO': Decimal('7499'),
  'ENAME': 'ALLEN',
  'JOB': 'SALESMAN',
  'MGR': Decimal('7698'),
  'HIREDATE': datetime.date(1981, 2, 20),
  'SAL': Decimal('1600.00'),
  'COMM': Decimal('300.00'),
  'DEPTNO': Decimal('30')},
 {'EMPNO': Decimal('7521'),
  'ENAME': 'WARD',
  'JOB': 'SALESMAN',
  'MGR': Decimal('7698'),
  'HIREDATE': datetime.date(1981, 2, 22),
  'SAL': Decimal('1250.00'),
  'COMM': Decimal('500.00'),
  'DEPTNO': Decimal('30')},
 {'EMPNO': Decimal('7566'),
  'ENAME': 'JONES',
  'JOB': 'MANAGER',
  'MGR': Decimal('7839'),
  'HIREDATE': datetime.date(1981, 4, 2),
  'SAL': Decimal('2975.00'),
  'COMM': None,
  'DEPTNO': Decimal('20')},
 {'EMPNO': Decimal('7654'),
  'ENAME': 'MARTIN',
  'JOB': 'SALESMAN',
  'MGR': Decimal('7698'),
  'HIREDATE': datetime.date(1981, 9, 28),
  'SAL': Decimal('1250.00'),
  'COMM': Decimal('1400.00'),
  'DEPTNO': Decimal('30')},
 {'EMPNO': Decimal('7698'),
  'ENAME': 'BLAKE',
  'JOB': 'MANAGER',
  'MGR': Decimal('7839'),
  'HIREDATE': datetime.date(1981, 5, 1),
  'SAL': Decimal('2850.00'),
  'COMM': None,
  'DEPTNO': Decimal('30')},
 {'EMPNO': Decimal('7782'),
  'ENAME': 'CLARK',
  'JOB': 'MANAGER',
  'MGR': Decimal('7839'),
  'HIREDATE': datetime.date(1981, 6, 9),
  'SAL': Decimal('2450.00'),
  'COMM': None,
  'DEPTNO': Decimal('10')},
 {'EMPNO': Decimal('7788'),
  'ENAME': 'SCOTT',
  'JOB': 'ANALYST',
  'MGR': Decimal('7566'),
  'HIREDATE': datetime.date(1987, 6, 28),
  'SAL': Decimal('3000.00'),
  'COMM': None,
  'DEPTNO': Decimal('20')},
 {'EMPNO': Decimal('7839'),
  'ENAME': 'KING',
  'JOB': 'PRESIDENT',
  'MGR': None,
  'HIREDATE': datetime.date(1981, 11, 17),
  'SAL': Decimal('5000.00'),
  'COMM': None,
  'DEPTNO': Decimal('10')},
 {'EMPNO': Decimal('7844'),
  'ENAME': 'TURNER',
  'JOB': 'SALESMAN',
  'MGR': Decimal('7698'),
  'HIREDATE': datetime.date(1981, 9, 8),
  'SAL': Decimal('1500.00'),
  'COMM': Decimal('0.00'),
  'DEPTNO': Decimal('30')},
 {'EMPNO': Decimal('7876'),
  'ENAME': 'ADAMS',
  'JOB': 'CLERK',
  'MGR': Decimal('7788'),
  'HIREDATE': datetime.date(1987, 7, 13),
  'SAL': Decimal('1100.00'),
  'COMM': None,
  'DEPTNO': Decimal('20')},
 {'EMPNO': Decimal('7900'),
  'ENAME': 'JAMES',
  'JOB': 'CLERK',
  'MGR': Decimal('7698'),
  'HIREDATE': datetime.date(1981, 12, 3),
  'SAL': Decimal('950.00'),
  'COMM': None,
  'DEPTNO': Decimal('30')},
 {'EMPNO': Decimal('7902'),
  'ENAME': 'FORD',
  'JOB': 'ANALYST',
  'MGR': Decimal('7566'),
  'HIREDATE': datetime.date(1981, 12, 3),
  'SAL': Decimal('3000.00'),
  'COMM': None,
  'DEPTNO': Decimal('20')},
 {'EMPNO': Decimal('7934'),
  'ENAME': 'MILLER',
  'JOB': 'CLERK',
  'MGR': Decimal('7782'),
  'HIREDATE': datetime.date(1982, 1, 23),
  'SAL': Decimal('1300.00'),
  'COMM': None,
  'DEPTNO': Decimal('10')}]

In [ ]:
db.emp.insert_many(result)

In [ ]:
# find_one() 제일 위에 있는 데이터만 출력
db.emp.find_one()

{'_id': ObjectId('6232b71d60cd40a56fec7846'),
 'EMPNO': '7369',
 'ENAME': 'SMITH',
 'JOB': 'CLERK',
 'MGR': '7902',
 'HIREDATE': '1980-12-17',
 'SAL': '800.00',
 'DEPTNO': '20'}

In [ ]:
# find = SELECT 기능 , 안에 조건 들어갈 수 있음
list(db.emp.find(
    {
        "ENAME" : "SMITH"
    }
))
# SELECT * FROM emp WHERE ENAME = "SMITH"

[{'_id': ObjectId('6232b71d60cd40a56fec7846'),
  'EMPNO': '7369',
  'ENAME': 'SMITH',
  'JOB': 'CLERK',
  'MGR': '7902',
  'HIREDATE': '1980-12-17',
  'SAL': '800.00',
  'DEPTNO': '20'}]

## emp collection
## key 값이 EMPNO, ENAME, DEPTNO만 출력이 되도록 코드를 작성

In [ ]:
result = db.emp.find(
    { },                     #첫번째 중괄호는 WHERE조건을 쓸 때 사용하는 공간 / 안에 띄어쓰기해야함
    {"EMPNO" : 1,
     "ENAME" : 1,
     "DEPTNO" : 1})      #두번째 중괄호는 COLUMN절/ KEY값을 선택할 수 있는 공간)

for list in result:
    print(list)

{'_id': ObjectId('6232b71d60cd40a56fec7846'), 'EMPNO': '7369', 'ENAME': 'SMITH', 'DEPTNO': '20'}
{'_id': ObjectId('6232b71e60cd40a56fec7847'), 'EMPNO': '7499', 'ENAME': 'ALLEN', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71e60cd40a56fec7848'), 'EMPNO': '7521', 'ENAME': 'WARD', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71e60cd40a56fec7849'), 'EMPNO': '7566', 'ENAME': 'JONES', 'DEPTNO': '20'}
{'_id': ObjectId('6232b71e60cd40a56fec784a'), 'EMPNO': '7654', 'ENAME': 'MARTIN', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71e60cd40a56fec784b'), 'EMPNO': '7698', 'ENAME': 'BLAKE', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71e60cd40a56fec784c'), 'EMPNO': '7782', 'ENAME': 'CLARK', 'DEPTNO': '10'}
{'_id': ObjectId('6232b71e60cd40a56fec784d'), 'EMPNO': '7788', 'ENAME': 'SCOTT', 'DEPTNO': '20'}
{'_id': ObjectId('6232b71e60cd40a56fec784e'), 'EMPNO': '7839', 'ENAME': 'KING', 'DEPTNO': '10'}
{'_id': ObjectId('6232b71e60cd40a56fec784f'), 'EMPNO': '7844', 'ENAME': 'TURNER', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71e60cd40a56fec7850'), 'EMPNO': '7876', 'ENAME': 'ADAMS', 'DEPTNO': '20'}
{'_id': ObjectId('6232b71e60cd40a56fec7851'), 'EMPNO': '7900', 'ENAME': 'JAMES', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71e60cd40a56fec7852'), 'EMPNO': '7902', 'ENAME': 'FORD', 'DEPTNO': '20'}
{'_id': ObjectId('6232b71e60cd40a56fec7853'), 'EMPNO': '7934', 'ENAME': 'MILLER', 'DEPTNO': '10'}

In [ ]:
result = db.emp.find().sort("ENAME")

for list in result:
    print(list)

# SELECT * FROM emp OREDER BY ENAME

{'_id': ObjectId('6232b71e60cd40a56fec7850'), 'EMPNO': '7876', 'ENAME': 'ADAMS', 'JOB': 'CLERK', 'MGR': '7788', 'HIREDATE': '1987-07-13', 'SAL': '1100.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b71e60cd40a56fec7847'), 'EMPNO': '7499', 'ENAME': 'ALLEN', 'JOB': 'SALESMAN', 'MGR': '7698', 'HIREDATE': '1981-02-20', 'SAL': '1600.00', 'COMM': '300.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71e60cd40a56fec784b'), 'EMPNO': '7698', 'ENAME': 'BLAKE', 'JOB': 'MANAGER', 'MGR': '7839', 'HIREDATE': '1981-05-01', 'SAL': '2850.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71e60cd40a56fec784c'), 'EMPNO': '7782', 'ENAME': 'CLARK', 'JOB': 'MANAGER', 'MGR': '7839', 'HIREDATE': '1981-06-09', 'SAL': '2450.00', 'DEPTNO': '10'}
{'_id': ObjectId('6232b71e60cd40a56fec7852'), 'EMPNO': '7902', 'ENAME': 'FORD', 'JOB': 'ANALYST', 'MGR': '7566', 'HIREDATE': '1981-12-03', 'SAL': '3000.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b71e60cd40a56fec7851'), 'EMPNO': '7900', 'ENAME': 'JAMES', 'JOB': 'CLERK', 'MGR': '7698', 'HIREDATE': '1981-12-03', 'SAL': '950.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71e60cd40a56fec7849'), 'EMPNO': '7566', 'ENAME': 'JONES', 'JOB': 'MANAGER', 'MGR': '7839', 'HIREDATE': '1981-04-02', 'SAL': '2975.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b71e60cd40a56fec784e'), 'EMPNO': '7839', 'ENAME': 'KING', 'JOB': 'PRESIDENT', 'HIREDATE': '1981-11-17', 'SAL': '5000.00', 'DEPTNO': '10'}
{'_id': ObjectId('6232b71e60cd40a56fec784a'), 'EMPNO': '7654', 'ENAME': 'MARTIN', 'JOB': 'SALESMAN', 'MGR': '7698', 'HIREDATE': '1981-09-28', 'SAL': '1250.00', 'COMM': '1400.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71e60cd40a56fec7853'), 'EMPNO': '7934', 'ENAME': 'MILLER', 'JOB': 'CLERK', 'MGR': '7782', 'HIREDATE': '1982-01-23', 'SAL': '1300.00', 'DEPTNO': '10'}
{'_id': ObjectId('6232b71e60cd40a56fec784d'), 'EMPNO': '7788', 'ENAME': 'SCOTT', 'JOB': 'ANALYST', 'MGR': '7566', 'HIREDATE': '1987-06-28', 'SAL': '3000.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b71d60cd40a56fec7846'), 'EMPNO': '7369', 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': '7902', 'HIREDATE': '1980-12-17', 'SAL': '800.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b71e60cd40a56fec784f'), 'EMPNO': '7844', 'ENAME': 'TURNER', 'JOB': 'SALESMAN', 'MGR': '7698', 'HIREDATE': '1981-09-08', 'SAL': '1500.00', 'COMM': '0.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71e60cd40a56fec7848'), 'EMPNO': '7521', 'ENAME': 'WARD', 'JOB': 'SALESMAN', 'MGR': '7698', 'HIREDATE': '1981-02-22', 'SAL': '1250.00', 'COMM': '500.00', 'DEPTNO': '30'}

In [ ]:
# 급여가 2000보다 큰 데이터만 출력
result = db.emp.find(
    { 
        "SAL" : {
            "$gt": 2000
        }
    }
)

for list in result:
    print(list)

In [ ]:
# 급여가 2450보다 크거나 같은 데이터만 출력
result = db.emp.find(
    { 
        "SAL" : {
            "$gte": 2450
        }
    }
)

for list in result:
    print(list)

In [ ]:
# 급여가 2450보다 작은 데이터만 출력
result = db.emp.find(
    { 
        "SAL" : {
            "$lt": 2450
        }
    }
)

for list in result:
    print(list)

In [ ]:
# SELECT * FROM emp WHERE ENAME = SMITH OR ENAME = ALLEN

result = db.emp.find(
    {
        "$or" : [
            {
                "ENAME" : "SMITH"
            },
            {
                "ENAME" : "ALLEN"
            }
        ]
    }
)

for list in result:
    print(list)

{'_id': ObjectId('6232b71d60cd40a56fec7846'), 'EMPNO': '7369', 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': '7902', 'HIREDATE': '1980-12-17', 'SAL': '800.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b71e60cd40a56fec7850'), 'EMPNO': '7876', 'ENAME': 'ADAMS', 'JOB': 'CLERK', 'MGR': '7788', 'HIREDATE': '1987-07-13', 'SAL': '1100.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b71e60cd40a56fec7851'), 'EMPNO': '7900', 'ENAME': 'JAMES', 'JOB': 'CLERK', 'MGR': '7698', 'HIREDATE': '1981-12-03', 'SAL': '950.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71e60cd40a56fec7853'), 'EMPNO': '7934', 'ENAME': 'MILLER', 'JOB': 'CLERK', 'MGR': '7782', 'HIREDATE': '1982-01-23', 'SAL': '1300.00', 'DEPTNO': '10'}
{'_id': ObjectId('6232c6d460cd40a56fec7854'), '': '0', 'EMPNO': '7369', 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': '7902', 'HIREDATE': '1980-12-17', 'SAL': '800.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232c6d460cd40a56fec785e'), '': '10', 'EMPNO': '7876', 'ENAME': 'ADAMS', 'JOB': 'CLERK', 'MGR': '7788', 'HIREDATE': '1987-07-13', 'SAL': '1100.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232c6d460cd40a56fec785f'), '': '11', 'EMPNO': '7900', 'ENAME': 'JAMES', 'JOB': 'CLERK', 'MGR': '7698', 'HIREDATE': '1981-12-03', 'SAL': '950.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232c6d460cd40a56fec7861'), '': '13', 'EMPNO': '7934', 'ENAME': 'MILLER', 'JOB': 'CLERK', 'MGR': '7782', 'HIREDATE': '1982-01-23', 'SAL': '1300.00', 'DEPTNO': '10'}

In [ ]:
# SELECT * FROM emp WHERE ENAME = SMITH AND JOB = CLERK
result = db.emp.find(
    {
        "ENAME" : "SMITH",
        "JOB" : "CLERK"
    }
)
for list in result:
    print(list)

{'_id': ObjectId('6232b71d60cd40a56fec7846'), 'EMPNO': '7369', 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': '7902', 'HIREDATE': '1980-12-17', 'SAL': '800.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232c6d460cd40a56fec7854'), '': '0', 'EMPNO': '7369', 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': '7902', 'HIREDATE': '1980-12-17', 'SAL': '800.00', 'DEPTNO': '20'}

In [68]:
# SELECT * FROM emp WHERE SAL >=2000 AND SAL < 4000
result = db.emp.find(
    {
        "SAL" : {
            "$gte" : 2000,
            "$lt" : 4000
        }
    },
    {
        "_id" : 0
    }
)

pd.DataFrame(result)

   EMPNO  ENAME      JOB   MGR    HIREDATE     SAL  DEPTNO
0   7566  JONES  MANAGER  7839  1981-04-02  2975.0      20
1   7698  BLAKE  MANAGER  7839  1981-05-01  2850.0      30
2   7782  CLARK  MANAGER  7839  1981-06-09  2450.0      10
3   7788  SCOTT  ANALYST  7566  1987-06-28  3000.0      20
4   7902   FORD  ANALYST  7566  1981-12-03  3000.0      20

In [70]:
# SELECT * FROM emp WHERE ENAME LIKE %S%

result = db.emp.find(
    {
        "ENAME" : {
            "$regex" : "S"
        }
    }
)
pd.DataFrame(result)

,_id,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,DEPTNO
0,6232d04260cd40a56fec7864,7369,SMITH,CLERK,7902,1980-12-17,800.0,20
1,6232d04260cd40a56fec7867,7566,JONES,MANAGER,7839,1981-04-02,2975.0,20
2,6232d04260cd40a56fec786b,7788,SCOTT,ANALYST,7566,1987-06-28,3000.0,20
3,6232d04260cd40a56fec786e,7876,ADAMS,CLERK,7788,1987-07-13,1100.0,20
4,6232d04260cd40a56fec786f,7900,JAMES,CLERK,7698,1981-12-03,950.0,30

In [72]:
# SELECT * FROM emp WHERE ENAME LIKE S%

result = db.emp.find(
    {
        "ENAME" : {
            "$regex" : "^S"
        }
    }
)
pd.DataFrame(result)

,_id,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,DEPTNO
0,6232d04260cd40a56fec7864,7369,SMITH,CLERK,7902,1980-12-17,800.0,20
1,6232d04260cd40a56fec786b,7788,SCOTT,ANALYST,7566,1987-06-28,3000.0,20

In [75]:
# SELECT * FROM emp WHERE ENAME LIKE %S%

result = db.emp.find(
    {
        "ENAME" : {
            "$regex" : "S$"
        }
    }
)
pd.DataFrame(result)

,_id,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,DEPTNO
0,6232d04260cd40a56fec7867,7566,JONES,MANAGER,7839,1981-04-02,2975.0,20
1,6232d04260cd40a56fec786e,7876,ADAMS,CLERK,7788,1987-07-13,1100.0,20
2,6232d04260cd40a56fec786f,7900,JAMES,CLERK,7698,1981-12-03,950.0,30

In [81]:
#SELECT ENAME, JOB, SAL, DEPTNO FROM emp 
# WHERE SAL > 1250 AND 
# SAL <=3000 AND 
# JOB = SALESMAN 
# ORDER BY ENAME


result = db.emp.find(
    { 
        "SAL" : {"$gt" : 1250,
        "$lte" : 3000},
        "JOB" : "SALESMAN"
    },
    {
        "ENAME" : 1,
        "JOB" : 1,
        "SAL" : 1,
        "DEPTNO" : 1,
        "_id" : 0
    }
).sort("ENAME")

#sort("ENAME",1) 오름차순
#sort("ENAME", -1) 내림차순

pd.DataFrame(result)

    ENAME       JOB     SAL  DEPTNO
0   ALLEN  SALESMAN  1600.0      30
1  TURNER  SALESMAN  1500.0      30

In [84]:
result = db.emp.find()

pd.DataFrame(result)

,_id,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,DEPTNO,COMM
0,6232d04260cd40a56fec7864,7369,SMITH,CLERK,7902.0,1980-12-17,880.0,20,NaN
1,6232d04260cd40a56fec7865,7499,ALLEN,SALESMAN,7698.0,1981-02-20,1600.0,30,300.0
2,6232d04260cd40a56fec7866,7521,WARD,SALESMAN,7698.0,1981-02-22,1250.0,30,500.0
3,6232d04260cd40a56fec7867,7566,JONES,MANAGER,7839.0,1981-04-02,2975.0,20,NaN
4,6232d04260cd40a56fec7868,7654,MARTIN,SALESMAN,7698.0,1981-09-28,1250.0,30,1400.0
5,6232d04260cd40a56fec7869,7698,BLAKE,MANAGER,7839.0,1981-05-01,2850.0,30,NaN
6,6232d04260cd40a56fec786a,7782,CLARK,MANAGER,7839.0,1981-06-09,2450.0,10,NaN
7,6232d04260cd40a56fec786b,7788,SCOTT,ANALYST,7566.0,1987-06-28,3000.0,20,NaN
8,6232d04260cd40a56fec786c,7839,KING,PRESIDENT,NaN,1981-11-17,5000.0,10,NaN
9,6232d04260cd40a56fec786d,7844,TURNER,SALESMAN,7698.0,1981-09-08,1500.0,30,0.0
10,6232d04260cd40a56fec786e,7876,ADAMS,CLERK,7788.0,1987-07-13,1100.0,20,NaN
11,6232d04260cd40a56fec786f,7900,JAMES,CLERK,7698.0,1981-12-03,950.0,30,NaN
12,6232d04260cd40a56fec7870,7902,FORD,ANALYST,7566.0,1981-12-03,3000.0,20,NaN
13,6232d04260cd40a56fec7871,7934,MILLER,CLERK,7782.0,1982-01-23,1300.0,10,NaN

In [83]:
db.emp.update_one(
    {
        "ENAME" : "SMITH"
    },
    {
        "$set" : {
            "SAL" : 880
        }
    }
)

In [85]:
result = db.emp.find(
    {
        "ENAME" : "SMITH"
    }
)

pd.DataFrame(result)

,_id,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,DEPTNO
0,6232d04260cd40a56fec7864,7369,SMITH,CLERK,7902,1980-12-17,880,20

In [86]:
db.emp.update_many(
    {
        "ENAME" : "ALLEN"
    },
    {
        "$set" : {
                    "SAL" : 2000
                }
    }
)

In [87]:
result = db.emp.find(
    {"ENAME" : "ALLEN"}
)
pd.DataFrame(result)

,_id,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,COMM,DEPTNO
0,6232d04260cd40a56fec7865,7499,ALLEN,SALESMAN,7698,1981-02-20,2000,300.0,30

In [88]:
db.emp.delete_one(
    {
        "JOB" : "PRESIDENT"
    }
)

In [92]:
result = db.emp.find(
    {
        "JOB" : "PRESIDENT"
    }
)
pd.DataFrame(result)

Empty DataFrame
Columns: []
Index: []

In [93]:
db.emp.delete_many(
    {
        "ENAME" : "WARD"
    }
)

In [94]:
result = db.emp.find(
    {
        "ENAME" : "WARD"
    }
)
pd.DataFrame(result)

Empty DataFrame
Columns: []
Index: []